{
  "backend/main.mo": "Motoko canister managing user profiles and ML health predictions with access control checks and stored maps per principal.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles of various frontend components, pages, hooks, and styling files.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH theme variables for light and dark modes and applying base colors.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React app setting up routing, providers, theme, Internet Identity, and Design B layout.",
  "frontend/src/auth/demoCredentialStore.ts": "LocalStorage-backed demo account system with simple hashing, account creation, lookup, and credential verification.",
  "frontend/src/auth/demoCredentialTypes.ts": "Type definitions for demo accounts and result types used during authentication flows.",
  "frontend/src/auth/session.ts": "Local session management utility handling storage, validation, expiration, and clearing of demo auth sessions.",
  "frontend/src/components/assistant/assistantBrain.ts": "Deterministic command interpreter handling navigation, medical queries, emergencies, and unsupported Flutter requests.",
  "frontend/src/components/assistant/AssistantPanel.tsx": "UI panel rendering transcript, status, speech input/output, and message controls, integrating speech recognition and TTS behaviors.",
  "frontend/src/components/assistant/assistantStorage.ts": "LocalStorage utilities for loading, saving, and clearing persisted assistant transcripts.",
  "frontend/src/components/assistant/assistantTypes.ts": "Type definitions for assistant messages, status, state, and command interpretation results.",
  "frontend/src/components/assistant/AssistantWidget.tsx": "Floating assistant widget managing panel state, routing commands, transcript updates, and voice/text input handling.",
  "frontend/src/components/assistant/medicalKnowledgeBase.ts": "Curated medical topics with keywords, clarifying questions, responses, red flags, and standard disclaimers.",
  "frontend/src/components/assistant/useAssistantTranscript.ts": "React hook managing transcript state with persistence and helpers for adding and clearing messages.",
  "frontend/src/components/assistant/useSpeechRecognition.ts": "React hook wrapping browser SpeechRecognition with transcript, interim results, errors, and start/stop control.",
  "frontend/src/components/assistant/useSpeechSynthesis.ts": "React hook handling speech synthesis enablement, speaking, cancellation, and state tracking.",
  "frontend/src/components/assistant/useTranscriptAutoScroll.ts": "Hook managing scroll position for transcripts, auto-scrolling when near bottom and exposing refs and scroll controls.",
  "frontend/src/designB/components/DashboardSectionHeader.tsx": "Header component rendering a title, optional caption, and optional action slot.",
  "frontend/src/designB/components/DashboardTile.tsx": "Configurable tile component with icon, label, value, and interactive or static variants.",
  "frontend/src/designB/components/DesignBSurface.tsx": "Surface wrapper applying themed background, shadow, or border based on variant.",
  "frontend/src/designB/components/DesignBTypography.tsx": "Set of typography components for titles, captions, and body text.",
  "frontend/src/designB/components/ThemeSwitcher.tsx": "Toggle switch for switching between default and Design B themes.",
  "frontend/src/designB/data/placeholders.ts": "Provides a mock user profile generated with a fixed seed.",
  "frontend/src/designB/layout/DesignBAppShell.tsx": "Main app shell with header, footer, bottom tabs, and assistant widget, adapting UI based on route and auth state.",
  "frontend/src/designB/layout/DesignBBottomTabs.tsx": "Bottom navigation bar with Home and Profile tabs, highlighting the active route.",
  "frontend/src/designB/storage/themePreference.ts": "Utilities for saving and loading theme preference to localStorage.",
  "frontend/src/designB/theme.ts": "Defines Design B theme tokens and functions to apply or remove the theme attribute.",
  "frontend/src/designB/themeContext.tsx": "Context provider managing current theme, persistence, and helper hook for accessing theme state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, recreating and invalidating queries on identity changes.",
  "frontend/src/hooks/useAuthSession.ts": "Hook for managing local authentication sessions including OTP, password, and guest modes.",
  "frontend/src/hooks/useDemoOtp.ts": "Hook implementing demo OTP generation, verification, cooldown tracking, and session resets.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication including login, logout, initialization, and identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Defines example React Query hooks and a user profile fetcher that depends on an authenticated actor.",
  "frontend/src/hooks/useRedirectIfAuthenticated.ts": "Redirects users to /home if they already have a valid Internet Identity or local session.",
  "frontend/src/hooks/useRequireAuth.ts": "Route guard that redirects unauthenticated users to /signin based on Internet Identity and local session state.",
  "frontend/src/hooks/useUserDisplayName.ts": "Resolves a user's display name using profile data, local session, or Internet Identity principal in priority order.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining themes, color variables, and design overrides.",
  "frontend/src/lib/flaker.ts": "Deterministic fake data generator producing user-like profiles using a seeded PRNG.",
  "frontend/src/lib/utils.ts": "Provides a utility function to merge class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity provider before rendering the app.",
  "frontend/src/pages/AppointmentDetails.tsx": "Empty page placeholder for appointment details.",
  "frontend/src/pages/Chatbot.tsx": "Authenticated chatbot page handling assistant messages, command interpretation, and navigation responses.",
  "frontend/src/pages/DoctorList.tsx": "Empty page placeholder for doctor list.",
  "frontend/src/pages/HomeDashboard.tsx": "Renders the authenticated user's health dashboard with today's metrics and quick action tiles. Includes navigation and various styled metric components.",
  "frontend/src/pages/Profile.tsx": "Displays and edits user profile details with a modal form, validation, and save handling. Supports sign‑out and loading states.",
  "frontend/src/pages/SignIn.tsx": "Implements phone-based OTP, password, and Internet Identity sign‑in flows with validation and redirects. Manages multi-step state and profile initialization.",
  "frontend/src/pages/SignUp.tsx": "Handles account creation with basic validation, local profile initialization, and redirect to the home dashboard. Supports full name, phone, and password inputs.",
  "frontend/src/pages/Welcome.tsx": "Landing page introducing the app with hero content and options to sign in or continue as guest. Redirects authenticated users automatically.",
  "frontend/src/profile/profileBackendMapper.ts": "Provides mapping functions between backend UserProfile structures and frontend ProfileDetails. Includes blood type conversions and date bigint ↔ string helpers.",
  "frontend/src/profile/profileLocalStore.ts": "Manages saving, loading, and clearing profile data in localStorage keyed by session type, with support for merging auth-provided data into existing profiles.",
  "frontend/src/profile/profileTypes.ts": "Defines the ProfileDetails interface and helpers for creating empty profiles and detecting if a profile contains any data.",
  "frontend/src/profile/profileValidation.ts": "Validates profile fields including name, email, phone, and emergency contact, returning a list of human-readable errors.",
  "frontend/src/profile/useProfileDetails.ts": "React hook that loads and saves profile data via backend or localStorage, using React Query for caching and mutations.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters, supporting both query strings and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, shadows, animations, and container settings for the app.",
  "project_state.json": "Project metadata describing state, issues, and feature requirements focused on fixing chat scrolling behavior."
}