{
  "backend/main.mo": "Motoko canister managing user profiles with access control, allowing users to view and save their own profile and admins to view others'. Uses Map storage and authorization mixin.",
  "feature_evidence.json": "Feature evidence report linking a deployment-related feature to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-written summaries of numerous frontend files describing their roles in the React Design B UI and supporting utilities.",
  "frontend/index.css": "Tailwind base styles defining light/dark theme CSS variables using OKLCH values and applying global background/foreground styling.",
  "frontend/index.html": "HTML entry point providing root div and loading the main React entry script.",
  "frontend/src/App.tsx": "Main React app wrapping routes with theme, Design B, Internet Identity, and React Query providers and defining all root routes.",
  "frontend/src/auth/demoCredentialStore.ts": "LocalStorage-backed demo credential system for creating accounts, verifying login, and retrieving stored demo users.",
  "frontend/src/auth/demoCredentialTypes.ts": "Type definitions for demo accounts and results returned by credential creation and verification functions.",
  "frontend/src/auth/session.ts": "Utility for persisting and validating local authentication sessions (OTP, password, guest) with expiration handling.",
  "frontend/src/components/assistant/assistantBrain.ts": "Parses user input with regex-based command interpretation to return navigation, help, or fallback responses.",
  "frontend/src/components/assistant/AssistantPanel.tsx": "UI panel for the voice assistant handling speech recognition, TTS, message display, and user input controls.",
  "frontend/src/components/assistant/assistantStorage.ts": "Provides localStorage persistence for assistant transcripts with load, save, and clear helpers.",
  "frontend/src/components/assistant/assistantTypes.ts": "Defines TypeScript types for assistant messages, status, state, and command interpretation results.",
  "frontend/src/components/assistant/AssistantWidget.tsx": "Implements the assistant widget UI, handling transcript storage, command processing, navigation, and integration with the AssistantPanel.",
  "frontend/src/components/assistant/useSpeechRecognition.ts": "Custom hook wrapping browser speech recognition, exposing listening state, transcripts, and control functions.",
  "frontend/src/components/assistant/useSpeechSynthesis.ts": "Custom hook for speech synthesis, allowing text-to-speech, cancellation, and toggling enabled state.",
  "frontend/src/designB/components/DashboardSectionHeader.tsx": "Renders a section header with title, optional caption, and optional action element.",
  "frontend/src/designB/components/DashboardTile.tsx": "Displays a styled dashboard tile with icon, label, optional value and caption, and supports interactive or static variants.",
  "frontend/src/designB/components/DesignBSurface.tsx": "Wrapper component applying themed surface styles for default, elevated, or outlined variants.",
  "frontend/src/designB/components/DesignBTypography.tsx": "Provides styled typography components including page titles, section titles, captions, and body text.",
  "frontend/src/designB/components/ThemeSwitcher.tsx": "Theme toggle component switching between the default and Design B themes using a switch UI.",
  "frontend/src/designB/data/placeholders.ts": "Defines a UserProfile interface and exports a seeded mock user generated via flaker.",
  "frontend/src/designB/layout/DesignBAppShell.tsx": "Defines the main app shell layout with header, content outlet, bottom tabs, assistant widget, and conditional user display based on authentication state.",
  "frontend/src/designB/layout/DesignBBottomTabs.tsx": "Renders the fixed bottom navigation bar with Home and Profile tabs, highlighting the active route.",
  "frontend/src/designB/storage/themePreference.ts": "Provides functions to save and load the selected design theme from localStorage with fallback handling.",
  "frontend/src/designB/theme.ts": "Defines the Design B theme configuration and functions to apply or remove the theme via DOM attribute changes.",
  "frontend/src/designB/themeContext.tsx": "Implements a React context for managing and persisting the active design theme with a provider and hook.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, invalidating queries when the actor changes.",
  "frontend/src/hooks/useAuthSession.ts": "Provides helpers to manage local session types (OTP, password, guest) and session validity checks.",
  "frontend/src/hooks/useDemoOtp.ts": "Implements an OTP demo flow with generation, verification, expiration handling, and resend cooldown logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a full Internet Identity authentication context, managing identity loading, login, logout, and state tracking.",
  "frontend/src/hooks/useQueries.ts": "Contains example backend query hooks, including fetching the caller's user profile via the actor.",
  "frontend/src/hooks/useRedirectIfAuthenticated.ts": "Redirects authenticated users away from public routes to /home based on Internet Identity or local session.",
  "frontend/src/hooks/useRequireAuth.ts": "Guards protected routes by redirecting unauthenticated users to /signin using identity and session checks.",
  "frontend/src/hooks/useUserDisplayName.ts": "Resolves a display name for the current user using profile data, local session info, or Internet Identity as fallback.",
  "frontend/src/index.css": "Defines Tailwind imports and extensive CSS variables for light, dark, and designB themes.",
  "frontend/src/lib/flaker.ts": "Implements a seeded random generator and functions to create deterministic fake user profile data.",
  "frontend/src/lib/utils.ts": "Provides a utility function that merges Tailwind class names using clsx and twMerge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AppointmentDetails.tsx": "Empty page placeholder for appointment details.",
  "frontend/src/pages/DoctorList.tsx": "Empty page placeholder for listing doctors.",
  "frontend/src/pages/HomeDashboard.tsx": "Renders the main health dashboard with metrics, quick actions, and protected access.",
  "frontend/src/pages/Profile.tsx": "Profile page allowing viewing, editing, validating, and saving user profile data with authentication.",
  "frontend/src/pages/SignIn.tsx": "Implements phone-based OTP and password sign‑in flows with Internet Identity integration.",
  "frontend/src/pages/SignUp.tsx": "Signup form handling name, phone, password validation, account creation, session setup, profile initialization, and navigation.",
  "frontend/src/pages/Welcome.tsx": "Landing page with hero content, feature preview, and navigation to sign-in or guest mode.",
  "frontend/src/profile/profileLocalStore.ts": "Manages localStorage-based profile loading, saving, clearing, and initialization tied to session type.",
  "frontend/src/profile/profileTypes.ts": "Defines ProfileDetails structure with defaults and a helper to detect if any profile data exists.",
  "frontend/src/profile/profileValidation.ts": "Validates profile fields including name, email, phone, and emergency contact, returning errors.",
  "frontend/src/profile/useProfileDetails.ts": "React hook that loads and saves profile data via backend or localStorage depending on session type.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, persisting, and clearing URL parameters from query strings or hashes.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, plugins, and extended theme utilities including shadows, keyframes, and CSS variable–based colors.",
  "project_state.json": "Defines the project’s state, noting a failed deployment, a fix request, and metadata for managing deployment-related features."
}