{
  "backend/main.mo": "Motoko canister managing user profiles, ML predictions, and medical file metadata with access control and storage mixins.",
  "feature_evidence.json": "Feature evidence report describing a deployment-related feature and its associated files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "JSON-style list mapping frontend file paths to short functional summaries for build planning.",
  "frontend/DEPLOY_NOTES.md": "Notes documenting fixes for frontend deployment issues involving env vars and provider composition.",
  "frontend/index.css": "Global Tailwind and theme variable definitions for light/dark modes using OKLCH color tokens.",
  "frontend/index.html": "Base HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring providers and TanStack Router routes for all screens.",
  "frontend/src/auth/demoCredentialStore.ts": "LocalStorage-based demo credential system handling account creation and password verification.",
  "frontend/src/auth/demoCredentialTypes.ts": "Type definitions for demo authentication accounts and credential results.",
  "frontend/src/auth/session.ts": "Local session manager storing and validating OTP, password, and guest authentication states.",
  "frontend/src/components/assistant/assistantBrain.ts": "Implements deterministic command interpretation for navigation, medical queries, emergencies, and report-analysis triggers. Matches user input against patterns and returns structured command results.",
  "frontend/src/components/assistant/AssistantPanel.tsx": "Renders the medical assistant UI with transcript display, speech recognition, TTS, and input handling. Manages status messaging, auto-scroll, and user interactions like sending messages and clearing history.",
  "frontend/src/components/assistant/assistantStorage.ts": "Handles saving, loading, and clearing assistant transcripts in localStorage using a versioned format. Provides simple persistence for conversations.",
  "frontend/src/components/assistant/assistantTypes.ts": "Defines TypeScript types for assistant messages, statuses, command results, and report-analysis context. Standardizes data structures used across assistant modules.",
  "frontend/src/components/assistant/AssistantWidget.tsx": "Provides the floating assistant widget that manages conversation flow, command handling, file-based report analysis, and integrates transcript and navigation logic.",
  "frontend/src/components/assistant/medicalKnowledgeBase.ts": "Provides a curated library of deterministic medical topics, disclaimers, clarifying questions, and emergency guidance. Used to generate consistent non-diagnostic health responses.",
  "frontend/src/components/assistant/reportAnalysis.ts": "Implements deterministic text-based medical report parsing to extract findings, generate interpretations, suggest actions, and identify red flags. Includes pattern-matching utilities for structured and unstructured reports.",
  "frontend/src/components/assistant/reportTextExtraction.ts": "Extracts UTF-8 text from likely text-based files and validates for non-binary content.",
  "frontend/src/components/assistant/useAssistantTranscript.ts": "Manages assistant message transcript with persistent storage and helpers to add or clear messages.",
  "frontend/src/components/assistant/useSpeechRecognition.ts": "Hook providing browser speech recognition with transcripts, interim text, errors, and control functions.",
  "frontend/src/components/assistant/useSpeechSynthesis.ts": "Hook to enable, trigger, and cancel speech synthesis using the Web Speech API.",
  "frontend/src/components/assistant/useTranscriptAutoScroll.ts": "Auto-scrolls a transcript container when new messages appear unless the user scrolls away from the bottom.",
  "frontend/src/designB/components/DashboardSectionHeader.tsx": "Renders a section header with title, optional caption, and optional action.",
  "frontend/src/designB/components/DashboardTile.tsx": "Configurable dashboard tile with icon, label, value, styling variants, and optional click interaction.",
  "frontend/src/designB/components/DesignBSurface.tsx": "Surface wrapper providing styled container variants like default, elevated, and outlined.",
  "frontend/src/designB/components/DesignBTypography.tsx": "Typography components for titles, captions, and body text with preset styles.",
  "frontend/src/designB/components/ThemeSwitcher.tsx": "Toggle switch to switch between default and Design B themes.",
  "frontend/src/designB/data/placeholders.ts": "Provides a demo user profile generated deterministically for mock data.",
  "frontend/src/designB/layout/DesignBAppShell.tsx": "Main app shell with header, footer, bottom tabs, assistant widget, and theme toggle, controlling visibility by route.",
  "frontend/src/designB/layout/DesignBBottomTabs.tsx": "Bottom navigation bar with Home, Reports, and Profile tabs linked to router navigation.",
  "frontend/src/designB/storage/themePreference.ts": "Loads and saves the user's selected theme to localStorage.",
  "frontend/src/designB/theme.ts": "Defines the Design B theme object and functions to apply or remove it by setting a data attribute on the document root.",
  "frontend/src/designB/themeContext.tsx": "Provides a React context for managing and persisting the active design theme, exposing theme state and a setter.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current Internet Identity, invalidating queries when the actor changes.",
  "frontend/src/hooks/useAuthSession.ts": "Exposes helper functions to manage local auth session types and check validity.",
  "frontend/src/hooks/useDemoOtp.ts": "Implements a demo OTP system with code generation, verification, expiry, resend cooldown, and session state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and logic for creating, loading, and managing Internet Identity authentication state.",
  "frontend/src/hooks/useMedicalFiles.ts": "Wraps backend medical file operations (list, upload, delete, download) with React Query and actor integration.",
  "frontend/src/hooks/useQueries.ts": "Contains sample query hooks and a hook to fetch the current user profile using the backend actor.",
  "frontend/src/hooks/useRedirectIfAuthenticated.ts": "Redirects authenticated users away from public routes to /home based on Internet Identity or local session.",
  "frontend/src/hooks/useRequireAuth.ts": "Guards protected routes by redirecting unauthenticated users to /signin using Internet Identity and session checks.",
  "frontend/src/hooks/useUserDisplayName.ts": "Resolves a display name using profile data, session info, or principal fallback via defined priority rules.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light, dark, and alternate design themes.",
  "frontend/src/lib/flaker.ts": "Implements a seeded random generator and utilities for generating deterministic fake user profile data.",
  "frontend/src/lib/utils.ts": "Provides a cn helper combining clsx and tailwind-merge for className merging.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AppointmentDetails.tsx": "Empty placeholder page component.",
  "frontend/src/pages/Chatbot.tsx": "Implements the medical chatbot page handling messages, report selection, file text extraction, and analysis flow.",
  "frontend/src/pages/DoctorList.tsx": "Empty placeholder page component.",
  "frontend/src/pages/HomeDashboard.tsx": "Renders the authenticated health dashboard with metrics and quick action tiles.",
  "frontend/src/pages/Locate.tsx": "Empty placeholder page component.",
  "frontend/src/pages/NotFoundRedirect.tsx": "Redirects unknown routes to /home on mount.",
  "frontend/src/pages/Profile.tsx": "Displays and edits user profile details with validation, saving, and sign‑out logic.",
  "frontend/src/pages/Report.tsx": "UI for uploading, listing, downloading, and deleting medical report files using medical file hooks and toast notifications.",
  "frontend/src/pages/SignIn.tsx": "Handles phone-based OTP, password sign-in, and Internet Identity login flows with validation and navigation.",
  "frontend/src/pages/SignUp.tsx": "Provides account creation with name, phone, and password, storing profile data and redirecting after successful signup.",
  "frontend/src/pages/Welcome.tsx": "Landing page with branding, hero image, and options to sign in or continue as guest.",
  "frontend/src/profile/profileBackendMapper.ts": "Maps profile data between backend UserProfile format and frontend ProfileDetails, including blood type and date conversions.",
  "frontend/src/profile/profileLocalStore.ts": "Manages localStorage-backed profile data per session, including loading, saving, clearing, and initializing profiles.",
  "frontend/src/profile/profileTypes.ts": "Defines editable ProfileDetails structure and helpers for creating and checking empty profiles.",
  "frontend/src/profile/profileValidation.ts": "Validates profile fields including name, email, phone, and emergency contact, returning error messages and a validity flag.",
  "frontend/src/profile/useProfileDetails.ts": "React hook that loads and saves user profile data from either backend via Internet Identity or local storage, using React Query.",
  "frontend/src/report/reportMetadataStore.ts": "Deprecated localStorage-based store for reading, writing, and deleting medical file metadata, kept for backward compatibility.",
  "frontend/src/utils/frontendEnv.ts": "Provides access to frontend environment config, mainly resolving the Internet Identity URL with a fallback.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based routing values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, animations, and included plugins.",
  "project_state.json": "Project metadata describing current state, issues, and deployment-related feature requirements."
}