{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing purposes of various frontend files across routing, theming, pages, and components.",
  "frontend/index.css": "Tailwind base styles plus extensive OKLCH theme variables for light/dark modes and global styling.",
  "frontend/index.html": "Minimal HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router with routes including SignUp and wraps the app with theme and Design B providers.",
  "frontend/src/auth/demoCredentialStore.ts": "LocalStorage-based demo credential system supporting account creation, uniqueness checks, and password verification.",
  "frontend/src/auth/demoCredentialTypes.ts": "Type definitions for demo accounts and results returned by credential creation and verification.",
  "frontend/src/auth/session.ts": "LocalStorage-backed session manager supporting otp, password, and guest session types.",
  "frontend/src/components/assistant/assistantBrain.ts": "Deterministic command interpreter parsing navigation, help, greetings, and fallback responses.",
  "frontend/src/components/assistant/AssistantPanel.tsx": "UI panel for voice/text assistant interactions handling speech recognition, TTS, messaging, and status display.",
  "frontend/src/components/assistant/assistantStorage.ts": "LocalStorage utilities for loading, saving, and clearing assistant transcripts.",
  "frontend/src/components/assistant/assistantTypes.ts": "Type definitions for assistant messages, status, state, and command results.",
  "frontend/src/components/assistant/AssistantWidget.tsx": "UI widget managing assistant panel state, message handling, storage sync, and navigation commands.",
  "frontend/src/components/assistant/useSpeechRecognition.ts": "Custom hook wrapping browser speech recognition with transcript, error, and control state.",
  "frontend/src/components/assistant/useSpeechSynthesis.ts": "Custom hook enabling speech synthesis with toggling, speaking, and canceling features.",
  "frontend/src/designB/components/DashboardSectionHeader.tsx": "Header component displaying a section title, optional caption, and action element.",
  "frontend/src/designB/components/DashboardTile.tsx": "Configurable dashboard tile with icon, label, value, caption, interactive states, and styling variants.",
  "frontend/src/designB/components/DesignBSurface.tsx": "Wrapper surface component applying background, border, or shadow variants.",
  "frontend/src/designB/components/DesignBTypography.tsx": "Typography components for page titles, section titles, captions, and body text.",
  "frontend/src/designB/components/ThemeSwitcher.tsx": "Toggle switch to change between default and Design B themes.",
  "frontend/src/designB/data/placeholders.ts": "Provides a mock user profile generated with a fixed seed.",
  "frontend/src/designB/layout/DesignBAppShell.tsx": "Main layout shell with header, footer, bottom navigation, and assistant widget integration.",
  "frontend/src/designB/layout/DesignBBottomTabs.tsx": "Bottom navigation bar for switching between Home and Profile routes.",
  "frontend/src/designB/storage/themePreference.ts": "Handles saving and loading the user's theme selection from localStorage.",
  "frontend/src/designB/theme.ts": "Defines the Design B theme and provides functions to apply or remove it via a DOM attribute.",
  "frontend/src/designB/themeContext.tsx": "Provides a React context for managing and persisting theme selection, exposing current theme and setter.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, recreating it when identity changes.",
  "frontend/src/hooks/useAuthSession.ts": "Wraps local auth session helpers for OTP, password, and guest sign‑ins with simple callbacks.",
  "frontend/src/hooks/useDemoOtp.ts": "Implements a demo OTP generator and verifier with expiry, resend cooldown, and session tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity state management via a React context.",
  "frontend/src/hooks/useQueries.ts": "Example React Query hook that waits for an actor before running backend queries.",
  "frontend/src/hooks/useRequireAuth.ts": "Route guard that redirects to /signin if neither Internet Identity nor a local session is present.",
  "frontend/src/index.css": "Base Tailwind CSS setup with light/dark variables and Design B theme overrides using data attributes.",
  "frontend/src/lib/flaker.ts": "Seeded fake‑data generator producing deterministic user profiles including names, contact info, and medical details.",
  "frontend/src/lib/utils.ts": "Utility function that merges Tailwind class names using clsx and tailwind‑merge.",
  "frontend/src/main.tsx": "Application entry that initializes React, React Query, and Internet Identity provider.",
  "frontend/src/pages/AppointmentDetails.tsx": "Empty placeholder page component.",
  "frontend/src/pages/DoctorList.tsx": "Empty placeholder page component.",
  "frontend/src/pages/HomeDashboard.tsx": "Dashboard page showing today's health metrics, quick logging actions, and sections for ML prediction categories with auth protection.",
  "frontend/src/pages/Profile.tsx": "Profile page displaying user info, contact details, and a sign‑out flow using Internet Identity and local sessions.",
  "frontend/src/pages/SignIn.tsx": "Sign‑in page implementing phone-based OTP, password login, and Internet Identity authentication.",
  "frontend/src/pages/SignUp.tsx": "Sign‑up page that collects user details, creates a demo account, and signs in the user on success.",
  "frontend/src/pages/Welcome.tsx": "Landing page with branding, hero content, feature highlights, and navigation to sign‑in or guest mode.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and container settings.",
  "project_state.json": "Contains project state metadata, including scope updates, architectural notes, known issues, and a list of defined UI features and requirements for the mobile health care app. It outlines design goals, removed flows, and versioned feature entries."
}