{
  "backend/main.mo": "Motoko canister managing user profiles and ML risk predictions with access control and persistence using maps.",
  "feature_evidence.json": "Feature evidence report linking dashboard tile changes to affected frontend files and components.",
  "frontend-file-summaries.txt": "Pre-generated summaries of multiple frontend files describing their purpose and functionality.",
  "frontend/index.css": "Global Tailwind and CSS variable definitions for theming in light and dark modes.",
  "frontend/index.html": "Base HTML document mounting the React app through main.tsx.",
  "frontend/src/App.tsx": "Main React app entry configuring providers and route definitions using TanStack Router.",
  "frontend/src/auth/demoCredentialStore.ts": "LocalStorage-backed demo credential system for creating and verifying phone/password accounts.",
  "frontend/src/auth/demoCredentialTypes.ts": "Type definitions for demo accounts and authentication result objects.",
  "frontend/src/auth/session.ts": "Local session management utilities supporting OTP, password, and guest auth with expiration.",
  "frontend/src/components/assistant/assistantBrain.ts": "Deterministic command interpreter that detects navigation, help, greetings, or unsupported Flutter requests and returns structured responses.",
  "frontend/src/components/assistant/AssistantPanel.tsx": "UI panel for viewing transcript, handling text and voice input, showing assistant status, and triggering TTS and scroll behavior.",
  "frontend/src/components/assistant/assistantStorage.ts": "LocalStorage helpers for loading, saving, and clearing the assistant transcript.",
  "frontend/src/components/assistant/assistantTypes.ts": "Type definitions for assistant messages, state, and command interpretation results.",
  "frontend/src/components/assistant/AssistantWidget.tsx": "Floating widget that opens the assistant panel, manages transcript state, runs command interpretation, and triggers navigation.",
  "frontend/src/components/assistant/useSpeechRecognition.ts": "React hook wrapping Web Speech API speech recognition, exposing listening state, transcripts, and error handling.",
  "frontend/src/components/assistant/useSpeechSynthesis.ts": "React hook for speech synthesis with enable toggle, speak/cancel functions, and speaking state.",
  "frontend/src/designB/components/DashboardSectionHeader.tsx": "Styled header component for dashboard sections with title, caption, and optional action area.",
  "frontend/src/designB/components/DashboardTile.tsx": "Configurable dashboard tile with icon, value, caption, color/size variants, and optional click interaction.",
  "frontend/src/designB/components/DesignBSurface.tsx": "Surface wrapper component providing default, elevated, or outlined styling options.",
  "frontend/src/designB/components/DesignBTypography.tsx": "Provides styled typography components like titles and body text using Tailwind classes.",
  "frontend/src/designB/components/ThemeSwitcher.tsx": "UI switch to toggle between default and Design B theme using context state.",
  "frontend/src/designB/data/placeholders.ts": "Defines a UserProfile type and exports a seeded mock user profile.",
  "frontend/src/designB/layout/DesignBAppShell.tsx": "Defines the main app layout with header, dynamic navigation, and assistant widget based on route and auth state.",
  "frontend/src/designB/layout/DesignBBottomTabs.tsx": "Renders bottom navigation tabs for Home and Profile with active-state styling.",
  "frontend/src/designB/storage/themePreference.ts": "Saves and loads theme preference to and from localStorage with error handling.",
  "frontend/src/designB/theme.ts": "Defines the Design B theme settings and functions to apply or remove its DOM attribute.",
  "frontend/src/designB/themeContext.tsx": "Provides context to manage theme state, persistence, and utilities for switching themes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useAuthSession.ts": "Manages local session actions for OTP, password, guest login, and session validation.",
  "frontend/src/hooks/useDemoOtp.ts": "Implements a demo OTP system with generation, verification, cooldown, and session tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading, login, logout, and identity management.",
  "frontend/src/hooks/useQueries.ts": "Contains example backend query hooks and a hook for fetching the current user profile via actor.",
  "frontend/src/hooks/useRedirectIfAuthenticated.ts": "Redirects users with valid identity or local session away from public pages to /home.",
  "frontend/src/hooks/useRequireAuth.ts": "Route guard that redirects unauthenticated users to /signin after checking identity and local session.",
  "frontend/src/hooks/useUserDisplayName.ts": "Hook that returns the user's display name based on profile info, session data, or Internet Identity with a fallback hierarchy.",
  "frontend/src/index.css": "Global Tailwind setup defining CSS variables for themes, dark mode, and an optional designB theme.",
  "frontend/src/lib/flaker.ts": "Deterministic fake data generator using a seeded PRNG to create realistic user profile fields.",
  "frontend/src/lib/utils.ts": "Utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point initializing React, react-query, Internet Identity provider, and global styles.",
  "frontend/src/pages/AppointmentDetails.tsx": "Empty placeholder file for the appointment details page.",
  "frontend/src/pages/DoctorList.tsx": "Empty placeholder file for the doctor list page.",
  "frontend/src/pages/HomeDashboard.tsx": "Protected dashboard page showing health metrics, quick logs, and various stat tiles.",
  "frontend/src/pages/Profile.tsx": "Protected profile page allowing users to view and edit personal details, update profile data, and sign out.",
  "frontend/src/pages/SignIn.tsx": "Sign-in page supporting OTP, password, and Internet Identity authentication flows with form handling.",
  "frontend/src/pages/SignUp.tsx": "Implements a sign-up form with validation, account creation, session setup, and local profile initialization before navigating to home.",
  "frontend/src/pages/Welcome.tsx": "Displays a welcome page with branding, hero image, feature highlight, and navigation to sign-in or guest mode.",
  "frontend/src/profile/profileBackendMapper.ts": "Provides functions to map profile data between backend UserProfile format and frontend ProfileDetails, including enum and date conversions.",
  "frontend/src/profile/profileLocalStore.ts": "Manages saving, loading, clearing, and initializing profile data in localStorage based on the active session type.",
  "frontend/src/profile/profileTypes.ts": "Defines the ProfileDetails interface, provides an empty profile factory, and checks if a profile contains any data.",
  "frontend/src/profile/profileValidation.ts": "Validates ProfileDetails fields and returns error messages for invalid or incomplete data.",
  "frontend/src/profile/useProfileDetails.ts": "React hook that loads and saves profile details using either backend (Internet Identity) or localStorage depending on session state.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash params, store and retrieve values in sessionStorage, and manage persisted URL parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom themes, colors, typography, container settings, animations, and plugin integrations.",
  "project_state.json": "Tracks project state for replacing the Energy Levels health insight with PCOD & PCOS risks, including features and pending requests."
}