{
  "backend/main.mo": "Implements user profile storage with access‑controlled queries and updates using AccessControl and a Principal‑keyed map.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs for authentication session behavior.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of major frontend files including pages, components, hooks, and theme utilities.",
  "frontend/index.css": "Defines global Tailwind layers and extensive OKLCH CSS variables for light and dark themes.",
  "frontend/index.html": "Basic HTML shell loading the React app root and main entry script.",
  "frontend/src/App.tsx": "Sets up the React app with routing, theme providers, Internet Identity context, React Query, and layout shell.",
  "frontend/src/auth/demoCredentialStore.ts": "Implements local demo account creation, storage, and password-based credential verification using localStorage.",
  "frontend/src/auth/demoCredentialTypes.ts": "Type definitions for demo accounts and results returned by credential creation and verification functions.",
  "frontend/src/auth/session.ts": "Manages local session persistence, validation, expiration, and clearing for non‑Internet‑Identity authentication flows.",
  "frontend/src/components/assistant/assistantBrain.ts": "Implements deterministic command parsing for navigation, help, greetings, and Flutter-related warnings.",
  "frontend/src/components/assistant/AssistantPanel.tsx": "Renders the voice assistant UI with transcript display, input handling, speech recognition, and text‑to‑speech features.",
  "frontend/src/components/assistant/assistantStorage.ts": "Handles saving, loading, and clearing assistant transcripts in localStorage.",
  "frontend/src/components/assistant/assistantTypes.ts": "Defines types for assistant messages, state, and command interpretation results.",
  "frontend/src/components/assistant/AssistantWidget.tsx": "Provides the assistant drawer widget, manages transcript state, handles commands, navigation, and persistence.",
  "frontend/src/components/assistant/useSpeechRecognition.ts": "Custom hook for browser speech recognition with transcript, interim updates, and error handling.",
  "frontend/src/components/assistant/useSpeechSynthesis.ts": "Custom hook for text‑to‑speech with enable toggling and speech control.",
  "frontend/src/designB/components/DashboardSectionHeader.tsx": "Displays a section header with title, optional caption, and optional action element.",
  "frontend/src/designB/components/DashboardTile.tsx": "Reusable dashboard tile component with icon, label, value, and interactive variants.",
  "frontend/src/designB/components/DesignBSurface.tsx": "Wrapper component providing card-like surfaces with variant styling.",
  "frontend/src/designB/components/DesignBTypography.tsx": "Defines styled typography components (titles, body, captions) using tailwind classes and a cn utility.",
  "frontend/src/designB/components/ThemeSwitcher.tsx": "Provides a toggle switch to change between default and Design B themes via context.",
  "frontend/src/designB/data/placeholders.ts": "Exports a demo user profile generated with a fixed seed and defines its TypeScript shape.",
  "frontend/src/designB/layout/DesignBAppShell.tsx": "Defines the main layout shell with header, navigation, footer, and conditional user display and assistant widget.",
  "frontend/src/designB/layout/DesignBBottomTabs.tsx": "Implements two bottom navigation tabs (Home, Profile) with active-state styling and routing.",
  "frontend/src/designB/storage/themePreference.ts": "Loads and saves the selected theme to localStorage with error handling.",
  "frontend/src/designB/theme.ts": "Defines the Design B theme config and functions to apply or remove the theme via DOM attributes.",
  "frontend/src/designB/themeContext.tsx": "Provides context for managing and persisting the current design theme with a provider and hook.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useAuthSession.ts": "Manages local auth session actions for OTP, password, and guest modes using session helpers.",
  "frontend/src/hooks/useDemoOtp.ts": "Implements a demo OTP generator/validator with expiration, resend cooldown, and session state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity integration, managing login state, stored identities, and exposing auth context.",
  "frontend/src/hooks/useQueries.ts": "Defines example backend queries and a user profile query that depends on the actor.",
  "frontend/src/hooks/useRedirectIfAuthenticated.ts": "Redirects authenticated users away from public pages to /home based on Internet Identity or local session.",
  "frontend/src/hooks/useRequireAuth.ts": "Route guard hook redirecting unauthenticated users to /signin using Internet Identity or local session checks.",
  "frontend/src/hooks/useUserDisplayName.ts": "Resolves the current user's display name using profile data, local sessions, or Internet Identity with a fallback order.",
  "frontend/src/index.css": "Defines global styles, Tailwind layers, and light/dark theme CSS variables with design theme overrides.",
  "frontend/src/lib/flaker.ts": "Provides a seeded random generator and utilities for generating deterministic fake user profile data.",
  "frontend/src/lib/utils.ts": "Exports a helper that merges Tailwind and conditional class names.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with query and Internet Identity providers.",
  "frontend/src/pages/AppointmentDetails.tsx": "Placeholder for the appointment details page.",
  "frontend/src/pages/DoctorList.tsx": "Placeholder for the doctor list page.",
  "frontend/src/pages/HomeDashboard.tsx": "Renders the authenticated user's health dashboard with metrics, quick logs, and UI tiles.",
  "frontend/src/pages/Profile.tsx": "Displays and edits authenticated user profile data with validation and sign‑out handling.",
  "frontend/src/pages/SignIn.tsx": "Implements OTP, password, and Internet Identity sign‑in flows with form handling and redirects.",
  "frontend/src/pages/SignUp.tsx": "Sign-up page with form validation, account creation via local demo store, and navigation after successful registration.",
  "frontend/src/pages/Welcome.tsx": "Landing page with hero content offering sign-in or guest access, redirecting authenticated users.",
  "frontend/src/profile/profileLocalStore.ts": "Manages saving, loading, and clearing profile data in localStorage based on the current session type.",
  "frontend/src/profile/profileTypes.ts": "Defines the ProfileDetails structure, provides empty defaults, and checks if any profile data exists.",
  "frontend/src/profile/profileValidation.ts": "Validates profile fields including name, email, phone, and emergency contact, returning structured errors.",
  "frontend/src/profile/useProfileDetails.ts": "React hook that loads and saves profile data via backend for Internet Identity or localStorage for local sessions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and container settings, extending themes and integrating several plugins.",
  "project_state.json": "Defines the project’s state, listing existing features and a pending request related to persistent login sessions."
}