{
  "kind": "build_request",
  "title": "Fix chat transcript scrolling so it no longer sticks and feels smooth",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the chat transcript area so it scrolls smoothly and never appears “stuck in one place” on the /chat page, including ensuring the transcript region reliably becomes scrollable within the available viewport height.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "can you make the chat section run smoothly it will stick at one place"
        ]
      },
      "acceptanceCriteria": [
        "On /chat, when the transcript grows beyond the visible area, the message list can be scrolled naturally (wheel/touch/trackpad) and does not get stuck.",
        "The transcript region properly takes remaining height in the chat layout (no collapsed or non-scrollable flex child behavior).",
        "No new layout regressions: header and input controls remain visible and usable while the transcript scrolls independently."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Make auto-scroll-to-bottom behavior reliable when new chat messages are added, using a scroll target that actually controls the scrollable viewport (avoid attaching scroll logic to a non-scrollable wrapper), without modifying any files under frontend/src/components/ui.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "can you make the chat section run smoothly it will stick at one place"
        ]
      },
      "acceptanceCriteria": [
        "When a new message is appended, the transcript scroll position updates to show the newest message at the bottom (unless the user has manually scrolled up, in which case behavior should not feel jumpy).",
        "Auto-scroll works consistently on initial load (when transcript is restored) and during ongoing conversation.",
        "No edits are made to shadcn/ui component source files under frontend/src/components/ui (compose around them instead)."
      ]
    }
  ],
  "constraints": [
    "Frontend files in frontend/src/components/ui are read-only and must not be edited.",
    "Do not change the authentication/session behavior; only address chat scrolling/smoothness."
  ],
  "nonGoals": [
    "Adding new chatbot capabilities, medical categories, or backend AI/ML changes.",
    "Introducing real-time messaging or websockets."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}