{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix frontend build/deploy blockers and align frontend auth/actor wiring",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Resolve frontend build/type/runtime issues that block full-stack deployment, ensuring the React asset build completes and loads after deploy.",
      "acceptanceCriteria": [
        "A fresh deployment attempt completes successfully without errors.",
        "Backend canister installs/updates successfully.",
        "Frontend build completes successfully and loads in the browser after deploy.",
        "If deployment previously failed due to a compile/build/config error, the underlying cause is fixed (not just re-run)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useInternetIdentity.ts",
          "operation": "modify",
          "description": "Remove/replace Node-specific environment access that can break Vite/TS builds (e.g., avoid relying on process.env) and instead use the project’s frontend config mechanism provided by the core-infrastructure component for Internet Identity provider configuration. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Fix TypeScript and runtime safety around access-control initialization by avoiding calls to methods missing from the typed backend interface unless they exist at runtime; ensure actor initialization remains compatible with the authorization component’s expected initialization behavior. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Align generated/declared backend typings with the actor methods used by the frontend (including any authorization/bootstrap helper invoked during actor creation) so the frontend TypeScript build succeeds without type errors."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Eliminate duplicate provider setup (React Query / Internet Identity) between main.tsx and App.tsx to prevent conflicting QueryClient instances and provider nesting issues that can cause build/runtime instability; keep a single, consistent top-level wiring."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "After normalizing provider ownership (main.tsx vs App.tsx), update App.tsx wiring to match the chosen single source of truth for QueryClientProvider and InternetIdentityProvider and confirm routing + Toaster still render correctly without introducing new routes."
        }
      ]
    }
  ]
}