{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Persist and validate local demo auth sessions + authenticated redirects",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Persist OTP/password/guest sign-ins via the existing healthcare_local_session localStorage key so refresh keeps users authenticated and protected routes remain accessible until sign-out.",
      "acceptanceCriteria": [
        "After completing OTP sign-in, password sign-in, or Continue as guest, reloading the browser keeps the user authenticated (the app does not redirect to /signin when navigating to protected routes).",
        "Protected routes that use the existing route guard continue to consider a stored local session as authenticated via localStorage (using the existing healthcare_local_session key).",
        "Signing out clears the local session so that a page reload no longer treats the user as authenticated."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Welcome.tsx",
          "operation": "modify",
          "description": "Update the \"Explore as Guest\" action to call the existing local session helper (via useAuthSession().continueAsGuest()) before navigating to /home, ensuring guest auth persists across reloads."
        },
        {
          "path": "frontend/src/hooks/useRequireAuth.ts",
          "operation": "modify",
          "description": "Ensure the route guard continues to rely on the local session validity signal (via useAuthSession().hasSession()) so protected routes do not redirect to /signin when a saved local session is valid."
        },
        {
          "path": "frontend/src/pages/Profile.tsx",
          "operation": "modify",
          "description": "Confirm sign-out clears both Internet Identity state and the saved local session (healthcare_local_session) and navigates to /signin with replace, so a reload is no longer authenticated."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Validate saved local sessions (shape + expiration window) so malformed or stale localStorage data does not keep users signed in indefinitely.",
      "acceptanceCriteria": [
        "Local session validation checks both shape/type (otp|password|guest) and a reasonable expiration window based on the stored timestamp.",
        "If the stored local session is expired or malformed, it is treated as unauthenticated and the app redirects to /signin for protected routes.",
        "Valid sessions continue to work without requiring the user to re-enter credentials on refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/auth/session.ts",
          "operation": "modify",
          "description": "Add a strict local session validator that (1) verifies required fields by session type, (2) enforces an expiration window derived from the stored timestamp, and (3) clears healthcare_local_session when invalid/expired. Update hasValidSession() (and optionally loadSession()) to use this validation so all callers consistently treat stale/malformed sessions as unauthenticated."
        },
        {
          "path": "frontend/src/hooks/useAuthSession.ts",
          "operation": "modify",
          "description": "Align hasSession() with the updated validated hasValidSession() behavior so the route guard and other callers automatically benefit from expiration/shape checks."
        },
        {
          "path": "frontend/src/hooks/useUserDisplayName.ts",
          "operation": "modify",
          "description": "Switch display-name resolution to only use a validated local session (and fall back when session is invalid/expired) so the UI does not show authenticated/session-derived identity for stale localStorage."
        },
        {
          "path": "frontend/src/designB/layout/DesignBAppShell.tsx",
          "operation": "modify",
          "description": "Ensure the header’s authenticated-user display logic uses the validated local session check so stale/malformed sessions do not show the signed-in UI state."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Auto-redirect authenticated users away from / and /signin to /home when Internet Identity is present or a valid local session exists.",
      "acceptanceCriteria": [
        "Visiting /signin while already authenticated automatically navigates to /home without requiring user interaction.",
        "Visiting / (welcome page) while already authenticated automatically navigates to /home.",
        "If no valid authentication exists, / and /signin continue to behave as they do now."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useRedirectIfAuthenticated.ts",
          "operation": "create",
          "description": "Create a small hook that checks authentication status using Internet Identity (respecting its initialization state) OR a validated local session, and performs a replace navigation to /home when authenticated. This should be usable from / and /signin without modifying immutable auth hooks."
        },
        {
          "path": "frontend/src/pages/SignIn.tsx",
          "operation": "modify",
          "description": "Invoke the new useRedirectIfAuthenticated hook so users who already have Internet Identity or a valid local session are automatically redirected to /home when visiting /signin."
        },
        {
          "path": "frontend/src/pages/Welcome.tsx",
          "operation": "modify",
          "description": "Invoke the new useRedirectIfAuthenticated hook so users who already have Internet Identity or a valid local session are automatically redirected to /home when visiting /."
        }
      ]
    }
  ]
}